<?php

namespace Database\Seeders;

use App\Company;
use Illuminate\Database\Seeder;

class CompanyTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        Company::create([
            'name' => 'شركة مورة فوم',
            'description' => 'تعد شركة مورة للعوازل من الشركات المهمة في مدينة الرياض، فهي تلعب دوراً حيوياً في الحفاظ على البيئة الداخلية للمنزل وحمايتها من التغيرات المناخية في المملكة. تستخدم شركة مورة للعوازل مواد عازلة مختلفة كالرغوة والألياف الزجاجية والخشب والأسمنت، وتقوم بعمليات العزل للمنازل والمباني التجارية والصناعية.
حيث تلعب شركة مورة  دورًا هامًا في بناء مبانٍ صديقة للبيئة وتقليل استهلاك الطاقة، حيث تتيح خدماتها للعملاء العمل على توفير المال على فواتير الكهرباء والوقود عن طريق تحسين كفاءة العزل الحراري. كما تحمي هذه الشركات المبنى من التسربات والتلف الناتج عن المياه والرطوبة، مما يؤدي إلى تقليل تكاليف الصيانة الدورية.
',
            'facebook' => 'https://facebook.com',
            'twitter' => 'https://twitter.com',
            'phone' => '966549362523',
            'photo' => 'عن الشركة'
        ]);
    }
}
